ubuntu_other.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>其他技巧</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="其他技巧"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-11 Wed"/>
<meta name="author" content="Joseph Pan"/>
<meta name="description" content="Ubuntu其他技巧"/>
<meta name="keywords" content="Ubuntu"/>
<link rel="stylesheet" href="./other/style.css" type="text/css"/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="./ubuntu_index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">其他技巧</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 把终端加到右键菜单</a></li>
<li><a href="#sec-2">2 清除桌面挂载硬盘图标</a></li>
<li><a href="#sec-3">3 如何提高wine的反应速度</a></li>
<li><a href="#sec-4">4 回收站在哪里</a></li>
<li><a href="#sec-5">5 强制清空回收站</a></li>
<li><a href="#sec-6">6 默认打开方式的配置文件在哪里</a></li>
<li><a href="#sec-7">7 Pidgin 的聊天记录在哪里</a></li>
<li><a href="#sec-8">8 安装PDF打印机</a></li>
<li><a href="#sec-9">9 nvidia快速重设显示设置及配置多显示器</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 把终端加到右键菜单</h2>
<div class="outline-text-2" id="text-1">




<pre class="example">sudo apt-get install nautilus-open-terminal 
</pre>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 清除桌面挂载硬盘图标</h2>
<div class="outline-text-2" id="text-2">




<pre class="example">gconftool-2 --set /apps/nautilus/desktop/volumes_visible 0 --type bool
恢复：
gconftool-2 --set /apps/nautilus/desktop/volumes_visible 1 --type bool
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 如何提高wine的反应速度</h2>
<div class="outline-text-2" id="text-3">




<pre class="example">sudo sed -ie '/GBK/,/^}/d' /usr/share/X11/locale/zh_CN.UTF-8/XLC_LOCALE
</pre>

<p>
  可能造成某些游戏帧数降低 
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 回收站在哪里</h2>
<div class="outline-text-2" id="text-4">




<pre class="example">Ubuntu8.04 Gnome 2.22.2 以后在 $HOME/.local/share/Trash/
Ubuntu8.04 之前在 $HOME/.Trash/
</pre>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 强制清空回收站</h2>
<div class="outline-text-2" id="text-5">




<pre class="example">sudo rm -fr $HOME/.local/share/Trash/files/
</pre>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 默认打开方式的配置文件在哪里</h2>
<div class="outline-text-2" id="text-6">




<pre class="example">#全局
/etc/gnome/defaults.list 
#个人
~/.local/share/applications/mimeapps.list
</pre>


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Pidgin 的聊天记录在哪里</h2>
<div class="outline-text-2" id="text-7">




<pre class="example">~/.purple/logs/
</pre>


</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 安装PDF打印机</h2>
<div class="outline-text-2" id="text-8">




<pre class="example">sudo apt-get install cups-pdf
</pre>

<p>
  打印生成的pdf文件在 ~/PDF 文件夹里面
</p>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> nvidia快速重设显示设置及配置多显示器</h2>
<div class="outline-text-2" id="text-9">




<pre class="example">sudo dpkg-reconfigure xserver-xorg
sudo nvidia-xconfig
#nvidia-settings 用于设置分辨率和多显示器
sudo nvidia-settings
</pre>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-04-11 Wed</p>
<p class="author">Author: Joseph Pan</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
